In [6]:
import pandas as pd
import numpy as np

In [7]:
df = pd.read_csv('employee_filter.csv', index_col=0)

In [8]:
# percentage of gender

round(df['gender'].value_counts()/df['gender'].count()*100,2)

F    50.4
M    49.6
Name: gender, dtype: float64

In [9]:
# percentage of country

round(df['country'].value_counts()/df['country'].count()*100,2)

Russia            32.1
Poland            17.5
United States     12.2
Japan              9.4
Thailand           8.1
Canada             7.0
Croatia            3.0
Norway             2.1
Spain              2.0
Germany            1.9
United Kingdom     1.4
South Korea        1.1
Bangladesh         0.7
Denmark            0.7
Australia          0.5
Switzerland        0.3
Name: country, dtype: float64

In [10]:
# Find Sheryl Itzakson

df[df['full_name'].str.contains('Sheryl Itzakson')]

,full_name,gender,address,country,university,job_title,company,salary,credit_card,balance,vehicle,birthday,shirt_size,bd_year,year,age
984,Sheryl Itzakson,F,99 Everett Pass,Poland,Andrzej Frycz Modrzewski Cracow College,Office Assistant IV,Amazon,67599,mastercard,329997,Ford,29/08/2000,XL,2000-08-29,2000,22

In [11]:
# Find female employee who is working with amazon and from poland

df[(df.gender.str.contains('F')) & (df.country.str.contains('Poland')) & (df.company.str.contains('Amazon'))]

,full_name,gender,address,country,university,job_title,company,salary,credit_card,balance,vehicle,birthday,shirt_size,bd_year,year,age
906,Paula Tulley,F,873 Jenna Plaza,Poland,Agricultural University of Szczecin,Structural Analysis Engineer,Amazon,49028,mastercard,515127,GMC,16/12/1998,XS,1998-12-16,1998,24
984,Sheryl Itzakson,F,99 Everett Pass,Poland,Andrzej Frycz Modrzewski Cracow College,Office Assistant IV,Amazon,67599,mastercard,329997,Ford,29/08/2000,XL,2000-08-29,2000,22

In [13]:
# Find paula tulley's country, job and company

df[df['full_name'].str.contains('Paula Tulley', case=True)][['full_name','country','job_title','company']]

        full_name country                     job_title company
906  Paula Tulley  Poland  Structural Analysis Engineer  Amazon

In [14]:
# I just want to paula's university name

df[df['full_name'].str.contains('Paula Tulley')]['university']

906    Agricultural University of Szczecin
Name: university, dtype: object

In [15]:
# Find a project manager who must be older than 30 

df[(df['job_title']=='Project Manager') & (df.age >= 30)]

,full_name,gender,address,country,university,job_title,company,salary,credit_card,balance,vehicle,birthday,shirt_size,bd_year,year,age
108,Ketty Edgeller,F,7 Buell Plaza,Canada,Université de Montréal,Project Manager,Centidel,78445,solo,254788,Holden,27/10/1990,XS,1990-10-27,1990,32
173,Clarke Cail,F,0234 Upham Place,Russia,East-Siberian State University of Technology,Project Manager,Wordpedia,69204,mastercard,543949,Porsche,14/12/1990,XS,1990-12-14,1990,32
764,Priscella Ghilardi,M,67360 School Pass,Russia,Perm State Technical University,Project Manager,InnoZ,35522,bankcard,508938,Buick,30/12/1990,L,1990-12-30,1990,32

In [16]:
# How many specialist are in this dataset ?

len(df[df['job_title'].str.contains('Specialist')])

50

In [17]:
# Highest paid specialist

df[df['job_title'].str.contains('Specialist')].sort_values(by='salary', ascending=False).head(5)

,full_name,gender,address,country,university,job_title,company,salary,credit_card,balance,vehicle,birthday,shirt_size,bd_year,year,age
708,Alvie Yoodall,M,61 Gina Road,Canada,Nova Scotia Agricultural College,Clinical Specialist,IBM,109805,visa,183396,Dodge,07/03/1992,3XL,1992-07-03,1992,30
610,Nady Hodgets,F,93170 Northridge Way,Germany,Brandenburgische Technische Universität Cottbus,Clinical Specialist,Youbridge,109489,bankcard,540177,Volkswagen,04/07/2000,2XL,2000-04-07,2000,22
625,Ettie Klazenga,M,16566 Lake View Junction,Russia,Siberian Academy of Public Services,Clinical Specialist,Jabbersphere,107694,solo,371325,Toyota,05/02/1999,L,1999-05-02,1999,23
399,Truman Ennion,M,7014 Northport Court,Russia,Udmurt State University,Clinical Specialist,Twimm,103363,visa,196739,BMW,09/10/1993,2XL,1993-09-10,1993,29
270,Dorey Shepperd,F,25065 Oneill Center,United States,Southwestern Christian University,Clinical Specialist,Twitterworks,102802,mastercard,140020,Toyota,03/03/1996,XL,1996-03-03,1996,26

In [18]:
# find scientist

len(df[df.job_title.str.contains('Scientist')])

11

In [19]:
# find software related

len(df[df.job_title.str.contains('Software')])

21

In [20]:
# Find analyst

len(df[df.job_title.str.contains('Analyst')])

58

In [21]:
# Find who working with data

len(df[df.job_title.str.contains('Data')])

19

In [22]:
# Find who working with database

len(df[df.job_title.str.contains('Database')])

7

In [23]:
# find engineer's

len(df[df.job_title.str.contains('Engineer')])

120

In [24]:
# find professor's

len(df[df.job_title.str.contains('Professor')])

35

In [39]:
# find project manager 

len(df[df.job_title.str.contains('Project Manager')])

16

In [25]:
# Find the person who get highest salary. Find his name, salary, company and country

df[df['salary'].max()==df['salary']][['full_name','salary','company','country']]

         full_name  salary company country
708  Alvie Yoodall  109805     IBM  Canada

In [27]:
# How many people's have salary and balance more than 50000

len(df[(df['salary']>50000) & (df['balance']>50000)])

720

In [28]:
# Count Google employee from every country 

df[df['company']=='Google']['country'].value_counts()

United States    6
Russia           5
Poland           4
Japan            3
Canada           2
Name: country, dtype: int64

In [29]:
# How many people from each country are working in the giant (Google,Apple etc) company?

df[(df['company']=='Google') + (df['company']=='Amazon') + (df['company']=='Apple') +
  (df['company']=='Microsoft') + (df['company']=='Facebook')]['country'].value_counts()

United States    15
Russia           15
Poland           11
Japan             6
Canada            6
Thailand          5
Spain             1
Norway            1
Name: country, dtype: int64

In [30]:
# Find 5 person visa credit-card user who get the minimum salary

df[df['credit_card']=='visa'].sort_values(by='salary').head(5)

,full_name,gender,address,country,university,job_title,company,salary,credit_card,balance,vehicle,birthday,shirt_size,bd_year,year,age
842,Goddard Stollenwerck,F,1 Ramsey Way,Canada,Ashton College,Sales Representative,Gabtune,20237,visa,356247,Mazda,24/10/1990,2XL,1990-10-24,1990,32
411,Gweneth Maykin,F,546 Porter Road,Russia,Tomsk State Pedagogical University,Associate Professor,Skinte,20238,visa,421752,Ford,28/07/1996,XL,1996-07-28,1996,26
648,Farah Ferry,M,7964 Mayfield Hill,United States,Pacific Northwest College of Art,Clinical Specialist,Zoomzone,20542,visa,444944,Pontiac,28/09/1995,M,1995-09-28,1995,27
770,Fredra Paolacci,F,91 Anniversary Court,Denmark,Aalborg University,Registered Nurse,Ntags,20658,visa,341113,Land Rover,05/02/1994,M,1994-05-02,1994,28
79,Cornelia Puttick,M,026 Monterey Parkway,Russia,Siberian Academy of Public Services,Developer IV,Ooba,21303,visa,315952,Jeep,05/12/1996,L,1996-05-12,1996,26

In [31]:
# How many people use mastercard

df['credit_card'].value_counts()['mastercard']

146

In [32]:
# get group visa

df.groupby('credit_card').get_group('visa')

,full_name,gender,address,country,university,job_title,company,salary,credit_card,balance,vehicle,birthday,shirt_size,bd_year,year,age
1,Janet Angear,M,95564 Autumn Leaf Place,Spain,Universidad Abierta Interactiva,Project Manager,Brainverse,31546,visa,484569,Mazda,28/05/1999,XL,1999-05-28,1999,23
13,Iggy Poel,M,19 Twin Pines Place,Norway,Molde University College,VP Quality Control,Gabspot,83116,visa,396933,Mercedes-Benz,18/06/1999,3XL,1999-06-18,1999,23
16,Britteny Hasel,M,9240 Muir Avenue,Poland,Gdansk Management College,General Manager,Bluezoom,83079,visa,229878,BMW,12/09/1999,S,1999-12-09,1999,23
18,Skylar Kamenar,M,59 Susan Court,United States,Missouri Baptist College,Assistant Professor,Jamia,108449,visa,202266,Jeep,10/05/1993,XS,1993-10-05,1993,29
22,Bertie Huntar,F,48643 Bartelt Road,Croatia,University of Split,Internal Auditor,LiveZ,68775,visa,90021,Jaguar,25/07/1992,S,1992-07-25,1992,30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
969,Tate Comar,F,55586 Kipling Crossing,Russia,St. Petersburg Institute of Arts and Restoration,Environmental Tech,Cogibox,102924,visa,320586,Ford,30/03/1991,S,1991-03-30,1991,31
973,Sigismond MacLaren,F,4 Northridge Terrace,Poland,Academy of Economics in Katowice,Registered Nurse,Kwideo,66477,visa,426084,Mercedes-Benz,11/11/1996,2XL,1996-11-11,1996,26
979,Idalina Audley,M,46 Aberg Court,Poland,Aleksander Gieysztor School of Humanities in Pultusk,Accountant II,Oba,84235,visa,288379,Toyota,09/10/1997,2XL,1997-09-10,1997,25
987,Elisabeth Churchin,M,7 Kim Drive,Australia,Blue Mountains Hotel School,Systems Administrator III,Skippad,50365,visa,473432,Mitsubishi,12/04/1996,S,1996-12-04,1996,26
994,Keane Udall,F,30896 Mariners Cove Pass,Russia,Samara State Aerospace University,Chemical Engineer,Izio,81424,visa,491681,Audi,22/08/2000,M,2000-08-22,2000,22

In [33]:
# How many people's use every credit_card in poland

df.query("country=='Poland'")['credit_card'].value_counts()

bankcard           33
visa               29
mastercard         29
instapayment       28
visa-electron      25
solo               16
americanexpress    15
Name: credit_card, dtype: int64

In [34]:
# How many visa credit cards does each country use?

df.groupby('credit_card').get_group('visa')['country'].value_counts()

Russia            42
Poland            29
United States     20
Japan             17
Canada            14
Thailand          14
Croatia            9
Denmark            5
Germany            3
Bangladesh         3
Norway             2
Australia          2
United Kingdom     2
Spain              1
Switzerland        1
South Korea        1
Name: country, dtype: int64

In [35]:
# if you want to be more specific

df.groupby('credit_card').get_group('visa')['country'].value_counts()['Bangladesh']

3

In [36]:
# Find the person whose name length is bigger than anyone

def get_max_len(lst):
    return max(enumerate(lst), key=lambda x: len(x[1]))

print(get_max_len(df['full_name']))

(868, 'Merrill Le Breton De La Vieuville')

In [37]:
df[df['full_name']=='Merrill Le Breton De La Vieuville']

,full_name,gender,address,country,university,job_title,company,salary,credit_card,balance,vehicle,birthday,shirt_size,bd_year,year,age
868,Merrill Le Breton De La Vieuville,M,776 Lakewood Gardens Trail,United States,Utah Valley State College,Paralegal,Avamm,95625,solo,283992,Dodge,27/11/1994,XL,1994-11-27,1994,28

In [38]:
# Another way to find this 

df[df.full_name.apply(lambda x: len(x) > 30)]

,full_name,gender,address,country,university,job_title,company,salary,credit_card,balance,vehicle,birthday,shirt_size,bd_year,year,age
868,Merrill Le Breton De La Vieuville,M,776 Lakewood Gardens Trail,United States,Utah Valley State College,Paralegal,Avamm,95625,solo,283992,Dodge,27/11/1994,XL,1994-11-27,1994,28